pandas project

índice:
1. importación
2. exploración de los datos
3. toma de decisiones
4. data cleaning
5. análisis

In [1]:
import pandas as pd
import re

In [2]:
data = pd.read_csv('GSAF5.csv', encoding = "ISO-8859-1")
data.head()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2016.09.18.c,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.c-NSB.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.c,2016.09.18.c,5993,NaN,NaN
1,2016.09.18.b,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,Chucky Luciano,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.b-Luciano.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.b,2016.09.18.b,5992,NaN,NaN
2,2016.09.18.a,18-Sep-16,2016,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,...,NaN,"Orlando Sentinel, 9/19/2016",2016.09.18.a-NSB.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.18.a,2016.09.18.a,5991,NaN,NaN
3,2016.09.17,17-Sep-16,2016,Unprovoked,AUSTRALIA,Victoria,Thirteenth Beach,Surfing,Rory Angiolella,M,...,NaN,"The Age, 9/18/2016",2016.09.17-Angiolella.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.17,2016.09.17,5990,NaN,NaN
4,2016.09.15,16-Sep-16,2016,Unprovoked,AUSTRALIA,Victoria,Bells Beach,Surfing,male,M,...,2 m shark,"The Age, 9/16/2016",2016.09.16-BellsBeach.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2016.09.16,2016.09.15,5989,NaN,NaN

la importación daba un error:
UnicodeDecodeError: 'utf-8' codec can't decode byte 0x92 in position 1: invalid start byte
Busqué este error y di con la solución en stackoverflow, que era añadir 'encoding = "ISO-8859-1"' como argumento al llamar a pd.read_csv

In [3]:
data.shape

(5992, 24)

In [4]:
# vamos a stripear y poner en minúsculas los nombres de las columnas, para que sea más fácil escribirlos
data.columns = data.columns.str.strip().str.lower()
data.columns

Index(['case number', 'date', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'injury', 'fatal (y/n)', 'time',
       'species', 'investigator or source', 'pdf', 'href formula', 'href',
       'case number.1', 'case number.2', 'original order', 'unnamed: 22',
       'unnamed: 23'],
      dtype='object')

In [5]:
# renombramos las columnas "case number" como "id" y "fatal (y/n)" como "fatal" para que sea más cómodo escribirlas
data = data.rename(columns = {"case number":"id", "fatal (y/n)": "fatal"})

In [6]:
# eliminar duplicados
before = len(data)
data = data.drop_duplicates()
after = len(data)
print('Number of duplicate records dropped: ', str(before - after))

Number of duplicate records dropped:  0

In [7]:
#vemos las columnas que tenemos y cuántos valores null tienen
null_cols = data.isnull().sum()
null_cols

id                           0
date                         0
year                         0
type                         0
country                     43
area                       402
location                   496
activity                   527
name                       200
sex                        567
age                       2681
injury                      27
fatal                       19
time                      3213
species                   2934
investigator or source      15
pdf                          0
href formula                 1
href                         3
case number.1                0
case number.2                0
original order               0
unnamed: 22               5991
unnamed: 23               5990
dtype: int64

In [8]:
# eliminamos las columnas que contengan más de 2500 nulls
print(data.shape)
drop_cols = list(null_cols[null_cols > 2500].index)
data = data.drop(drop_cols, axis=1)
print(data.shape)

(5992, 24)
(5992, 19)

In [9]:
#nos quedamos solo con los datos posteriores a 1920
data = data[data.year >= 1920]
data.reset_index
data.shape

(5030, 19)

In [10]:
# nos quedamos con las columnas que nos interesan
data = data[["id", "year", "type", "country", "activity", "fatal"]]
data.shape

(5030, 6)

In [11]:
# comprobamos nulls
null_cols = data.isnull().sum()
null_cols

id            0
year          0
type          0
country      21
activity    395
fatal         8
dtype: int64

In [12]:
# eliminamos las filas que contienen nulls
data = data[data.country.notnull()]
data = data[data.activity.notnull()]
data = data[data.fatal.notnull()]
data.reset_index
data.shape

(4611, 6)

In [13]:
# comprobamos que ya no tenemos nulls en ningún campo
null_cols = data.isnull().sum()
null_cols

id          0
year        0
type        0
country     0
activity    0
fatal       0
dtype: int64

In [14]:
# vamos a cambiar el orden de las columnas, para ponerlas a nuestro gusto
column_order = ["id", "year", "country", "type", "activity", "fatal" ]
data = data[column_order]
data.head()

             id  year    country        type activity fatal
0  2016.09.18.c  2016        USA  Unprovoked  Surfing     N
1  2016.09.18.b  2016        USA  Unprovoked  Surfing     N
2  2016.09.18.a  2016        USA  Unprovoked  Surfing     N
3    2016.09.17  2016  AUSTRALIA  Unprovoked  Surfing     N
4    2016.09.15  2016  AUSTRALIA  Unprovoked  Surfing     N

In [15]:
# comprobamos si hay algún id duplicado. aquí tenemos que contar por una variable que no sea el id. cogemos year, ya que hemos visto que no tiene nulls
data.groupby("id").count()[["year"]].sort_values("year", ascending=False).head(11)

              year
id
2013.10.05       2
1966.12.26       2
1923.00.00.a     2
2006.09.02       2
1962.06.11.b     2
2014.08.02       2
2009.12.18       2
1980.07.00       2
1990.05.10       2
2012.09.02.b     2
2002.09.16.b     1

In [16]:
"""
vamos a asignar ids únicos a los que están duplicados
la siguiente función evalúa todos los ids y, en caso de que, a la hora de evaluar uno de ellos,
ya exista otro registro con ese mismo id, le pone una "a" al final, para diferenciarlo.
"""
def duplicates(id_column):
    new_id_column = []
    for i in range(len(id_column)):
        new_id = str(id_column[i])
        if new_id not in new_id_column:
            new_id_column.append(new_id)
        else:
            new_id_column.append(new_id + "a")
    return new_id_column

In [17]:
# aplicamos la función duplicates para la columna id
data["id"] = duplicates(list(data["id"]))
data.reset_index

<bound method DataFrame.reset_index of                   id  year        country          type  \
0       2016.09.18.c  2016            USA    Unprovoked
1       2016.09.18.b  2016            USA    Unprovoked
2       2016.09.18.a  2016            USA    Unprovoked
3         2016.09.17  2016      AUSTRALIA    Unprovoked
4         2016.09.15  2016      AUSTRALIA    Unprovoked
5       2016.09.15.R  2016      AUSTRALIA          Boat
6         2016.09.11  2016            USA    Unprovoked
7         2016.09.07  2016            USA    Unprovoked
8         2016.09.06  2016  NEW CALEDONIA    Unprovoked
9       2016.09.05.b  2016            USA    Unprovoked
10      2016.09.05.a  2016      AUSTRALIA    Unprovoked
11        2016.09.04  2016            USA    Unprovoked
12        2016.09.01  2016            USA    Unprovoked
13      2016.08.29.b  2016            USA    Unprovoked
14      2016.08.29.a  2016            USA    Unprovoked
15        2016.08.27  2016        REUNION    Unprovoked
16        2016.08.25  2016            USA    Unprovoked
17        2016.08.07  2016        BAHAMAS    Unprovoked
18        2016.08.06  2016            USA    Unprovoked
19        2016.08.04  2016            USA    Unprovoked
20        2016.07.29  2016          SPAIN    Unprovoked
21      2016.07.28.R  2016          CHINA    Unprovoked
22        2016.07.28  2016      AUSTRALIA          Boat
23        2016.07.27  2016            USA      Provoked
24        2016.07.26  2016      AUSTRALIA    Unprovoked
25        2016.07.24  2016          JAPAN    Unprovoked
26      2016.07.23.b  2016      AUSTRALIA    Unprovoked
27      2016.07.23.a  2016        BAHAMAS    Unprovoked
28        2016.07.20  2016      AUSTRALIA      Provoked
29        2016.07.17  2016            USA          Boat
...              ...   ...            ...           ...
4998      1922.03.02  1922      AUSTRALIA    Unprovoked
4999    1922.02.22.R  1922      AUSTRALIA       Invalid
5000      1922.02.04  1922      AUSTRALIA    Unprovoked
5001    1922.01.28.R  1922           IRAQ    Unprovoked
5002      1922.01.15  1922      AUSTRALIA    Unprovoked
5003      1922.01.13  1922      AUSTRALIA    Unprovoked
5004      1922.01.04  1922      AUSTRALIA    Unprovoked
5005      1921.12.11  1921      AUSTRALIA    Unprovoked
5006    1921.11.27.b  1921      AUSTRALIA    Unprovoked
5007    1921.11.27.a  1921      AUSTRALIA    Unprovoked
5008    1921.11.15.R  1921           FIJI    Unprovoked
5009      1921.10.12  1921      AUSTRALIA    Unprovoked
5010      1921.10.04  1921      AUSTRALIA    Unprovoked
5011      1921.09.00  1921        ENGLAND      Provoked
5013      1921.08.28  1921    PHILIPPINES    Unprovoked
5015      1920.11.29  1920      AUSTRALIA    Unprovoked
5016      1921.08.22  1921          HAITI    Unprovoked
5017      1920.11.22  1920      AUSTRALIA    Unprovoked
5018      1920.11.04  1920    PHILIPPINES  Sea Disaster
5019      1920.07.14  1920            USA       Invalid
5020    1920.07.05.R  1920      AUSTRALIA    Unprovoked
5021      1920.06.29  1920            USA    Unprovoked
5022      1920.06.27  1920         CANADA      Provoked
5023      1920.03.08  1920      AUSTRALIA    Unprovoked
5024  1920.01.24.R.b  1920      AUSTRALIA    Unprovoked
5025      1920.02.03  1920   SOUTH AFRICA    Unprovoked
5026  1920.01.24.R.a  1920      AUSTRALIA    Unprovoked
5027      1920.01.15  1920      AUSTRALIA    Unprovoked
5028    1920.00.00.b  1920        JAMAICA    Unprovoked
5030    1920.00.00.a  1920   SOUTH AFRICA    Unprovoked

                                               activity fatal
0                                               Surfing     N
1                                               Surfing     N
2                                               Surfing     N
3                                               Surfing     N
4                                               Surfing     N
5                                               Fishing     N
6                                                Wading     N
7                                              Swimming     N
8                                          Kite surfing     Y
9                                       Boogie boarding     N
10                                              Surfing     N
11                                        Body boarding     N
12                                         Spearfishing     N
13                                              Surfing     N
14                                              Surfing     N
15                                              Surfing     N
16                                               Wading     N
17                                           Snorkeling     N
18                                    SUP Foil boarding     N
19                                              Surfing     N
20                                             Swimming     N
21                                             Swimming     N
22                                             Kayaking     N
23                                           Lobstering     N
24                                              Surfing     N
25                                              Surfing     N
26                                              Surfing     N
27                                         Spearfishing     N
28                                              Fishing     N
29                Fishing in Alabama Deep Fishing Rodeo     N
...                                                 ...   ...
4998                         Bathing in knee-deep water     Y
4999                                           Swimming     Y
5000                                           Swimming     Y
5001                                            Bathing     Y
5002                                          Swimming      Y
5003                                           Standing     N
5004                                            Surfing     Y
5005                                           Swimming     N
5006         Fell from his father's back into the water     Y
5007                 Wading to dinghy, carrying his son     N
5008                                           Swimming     Y
5009                           Diving for beche-de-mer      N
5010                            Diving for beche-de-mer     Y
5011                                            Fishing     N
5013                                           Swimming     Y
5015                                             Wading     N
5016                    Dived into a school of baitfish     Y
5017                                           Standing     N
5018  The coastwise steamer San Basilio capsized in ...     Y
5019                                          Swimming      Y
5020                           Diving for trochus shell     N
5021                                          Swimming      N
5022                                    Harpooned shark     N
5023                   Boat capsized, swimming to shore     N
5024                                             Diving     N
5025                                 Floating face down     N
5026                                        Free diving     Y
5027                                          Swimming      Y
5028                                   Jumped overboard     Y
5030                                          Splashing     N

[4611 rows x 6 columns]>

In [18]:
# comprobamos ahora que solo existe un registro para cada id
data.groupby("id").count()[["year"]].sort_values("year", ascending=False).head(14)

              year
id
1920.00.00.a     1
2006.09.30       1
2002.09.27.a     1
2002.09.21.b     1
2002.09.21.a     1
2002.09.16.b     1
2002.09.16.a     1
2002.09.13       1
2002.09.09       1
2002.09.05       1
2002.08.28       1
2002.08.17       1
2002.08.14       1
2002.08.11       1

In [19]:
# vemos el contenido que existe en el campo "type"
data.groupby("type").count()[["id"]]

                id
type
Boat           172
Boating         65
Invalid        321
Provoked       473
Sea Disaster   157
Unprovoked    3423

In [20]:
# unificar type Boat y Boating
data = data.replace({'type': "Boating"}, "Boat")

In [21]:
# comprobación
data.groupby("type").count()[["id"]]

                id
type
Boat           237
Invalid        321
Provoked       473
Sea Disaster   157
Unprovoked    3423

In [22]:
# vemos cuales son los países en los que más ataques se han dado en los años tenidos en cuenta
countries = data.groupby("country").count()[["id"]].sort_values("id", ascending = False)
display(countries.head())

                    id
country
USA               1800
AUSTRALIA          949
SOUTH AFRICA       483
PAPUA NEW GUINEA   106
BRAZIL              92

In [23]:
# vemos el contenido que hay en el campo "fatal"
data.groupby("fatal").count()[["id"]].sort_values("id", ascending = False)

           id
fatal
N        3640
Y         930
UNKNOWN    35
 N          6

In [24]:
# vamos a aplicar strip() en la columna "fatal" para unificar datos
data["fatal"] = data["fatal"].str.strip()
# además, vemos que hay un registro con "F". entendemos que se refiere a fatal, así que lo cambiamos por "Y"
data = data.replace({"fatal": "F"}, "Y")

In [25]:
# comprobación
data.groupby("fatal").count()[["id"]].sort_values("id", ascending = False)

           id
fatal
N        3646
Y         930
UNKNOWN    35

In [26]:
data.groupby("activity").count()[["id"]].sort_values("id", ascending = False).head()

               id
activity
Surfing       900
Swimming      642
Fishing       338
Spearfishing  319
Wading        132

In [27]:
# vamos a aplicar .strip() y .lower() en la columna "activity" para unificar datos
data["activity"] = data["activity"].str.strip().str.lower()
data.groupby("activity").count()[["id"]].sort_values("id", ascending = False).head()

               id
activity
surfing       903
swimming      686
fishing       349
spearfishing  322
wading        132

In [30]:
# a simple vista podemos ver que hemos conseguido unificar algunos datos
# ahora vamos a agrupar las activities en unos pocos grupos
def group_act(e):
    if "fish" in e:
        e = "fishing"
        
data["activity"].apply(group_act, 1)

KeyError: 'activity'

In [29]:
data.groupby("activity").count()[["id"]].sort_values("id", ascending = False).head()

KeyError: 'activity'